//DBALLOC  JOB (ACCT),'DBASE ALLOC',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//IDCAMS   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE IBMUSER.DBASE.KV CLUSTER PURGE
  SET MAXCC=0
  DEFINE CLUSTER (NAME(IBMUSER.DBASE.KV) -
         INDEXED -
         KEYS(64 0) -
         RECORDSIZE(1024 1024) -
         RECORDS(16000 4000) -
         SHAREOPTIONS(2 3) -
         UNIQUE -
         SPEED VOLUMES(TSO003)) -
    DATA (NAME(IBMUSER.DBASE.KV.DATA)) -
    INDEX (NAME(IBMUSER.DBASE.KV.INDEX))
/*
