//DBRECV   JOB (ACCT),'DBASE RECV',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//DEL      EXEC PGM=IEFBR14
//OLDLOAD  DD DSN=IBMUSER.DBASE.LOAD,DISP=(MOD,DELETE,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(1,1))
//RECV     EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 RECEIVE INDSN('IBMUSER.MBT.XMIT.IN') -
  DATASET('IBMUSER.DBASE.LOAD') -
  VOLUME('TSO003')
/*
